Revit 2026 API

# DrawLayer Enumeration

---

An enumerated type containing possible DrawLayer options.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum DrawLayer
```
```vb
Public Enumeration DrawLayer
```
```cpp
public enum class DrawLayer
```
```fsharp
type DrawLayer
```

| Member name | Value | Description |
| --- | --- | --- |
| Background | 1 | Draw in the background layer |
| Foreground | 0 | Draw in the foreground layer |

#### Reference

Autodesk.Revit.DB Namespace